#+TITLE: 走进操作系统
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2023-10-30 Mon>
#+STARTUP: overview num indent


** 为什么选 xv6 代码阅读?
第一点: 代码量适中，统计大约 6000 行左右

xv6 代码统计
#+BEGIN_SRC sh :results output :exports results :dir /data/gitana/study/os/xv6-public
  make clean > /dev/null
  cloc --quiet .
#+END_SRC

#+RESULTS:
#+begin_example
  github.com/AlDanial/cloc v 1.90  T=0.06 s (1311.7 files/s, 159249.8 lines/s)
  -------------------------------------------------------------------------------
  Language                     files          blank        comment           code
  -------------------------------------------------------------------------------
  C                               46           1023            755           6455
  C/C++ Header                    22            145            131            842
  make                             1             36             33            210
  Assembly                         7             51            117            201
  Perl                             4             22             23            105
  Pascal                           1             24             60             50
  Bourne Shell                     3              7              3             23
  Lisp                             1              0              0              4
  -------------------------------------------------------------------------------
  SUM:                            85           1308           1122           7890
  -------------------------------------------------------------------------------
#+end_example

linux 0.11 代码统计
#+BEGIN_SRC sh :results output :exports results :dir /data/gitana/study/os/linux-0.11
  cloc --quiet .
#+END_SRC

#+RESULTS:
#+begin_example
  github.com/AlDanial/cloc v 1.90  T=0.09 s (1163.5 files/s, 161025.8 lines/s)
  -------------------------------------------------------------------------------
  Language                     files          blank        comment           code
  -------------------------------------------------------------------------------
  C                               51            782           1049           6747
  C/C++ Header                    33            327            260           2154
  Assembly                         8            165            312           1458
  make                             8             74             52            460
  -------------------------------------------------------------------------------
  SUM:                           100           1348           1673          10819
  -------------------------------------------------------------------------------
#+end_example

minix1 代码统计
#+BEGIN_SRC sh :results output :exports results :dir /data/gitana/study/os/minix1/kernel
  cloc --quiet .
#+END_SRC

#+RESULTS:
#+begin_example
  github.com/AlDanial/cloc v 1.90  T=0.05 s (451.0 files/s, 133013.8 lines/s)
  -------------------------------------------------------------------------------
  Language                     files          blank        comment           code
  -------------------------------------------------------------------------------
  C                               12            706           1245           3083
  Assembly                         4            224            386            970
  make                             2             30              6            149
  DOS Batch                        2              1              0            139
  C/C++ Header                     4             25             27             88
  -------------------------------------------------------------------------------
  SUM:                            24            986           1664           4429
  -------------------------------------------------------------------------------
#+end_example

第二点：代码比较干净 clean code
- 用于教学
- xv6 的原始代码设计的结构相对于 Linux 0.11 和 minix1 要好一些
- 可以学到一些好的编程实践

第三点：代码比较现代 morden
1. 可以很轻松地在 macos 和 linux 发行版中编译调试
2. 作者值得信赖
   - 源自 Dennis Ritchie 和 Ken Thompson 的 Unix Version 6
   - Robert Morris 是 Cornell University 的学生，年仅 23 岁。蠕虫病毒发明者，通过互
     联网传播直接侵犯到美国陆军弹道研究实验室
   - Frans Kaashoek 时 MIT 操作系统/分布式系统课程教授，系统研究领域 TOP 团队

和真实操作系统对比缺失部分
1. 没有网络部分的实现 net
2. 系统中有一些限制, 相比于真实操作系统要简化一些
   - [[file:../../study/os/xv6-public/param.h]]
   - round robin

